---
kind: other
id: Properties.T:Autodesk.Revit.DB.Mechanical.ZoneElementDomainData
source: html/d52f067b-013b-e0b7-cec7-09e8db0c2aa3.htm
---
# ZoneElementDomainData Properties

Specifies whether the .NET object represents a valid Revit entity.